list_numbers = [2, 90, -2, 8, -36, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

max_chis = 0  # максимальный элемент
i_chis = 0  # индекс макс элеиента

for i in range(20):  # проходим по массиву и запоминаем макс элемент и его индекс
    if list_numbers[i] >= max_chis:
        max_chis = list_numbers[i]
        i_chis = i

list_numbers[i_chis], list_numbers[-1] = list_numbers[-1], max_chis  # вместо макс. - последний, последнего - макс.

print(list_numbers)  # Ответ [2, 90, -2, 8, -36, -44, -1, -85, -14, 25, -22, -90, -100, -8, 38, -92, -45, 67, 53, 90]
# пустая строка
