slovar = {}  # заводим пустой словарь куда будем записыватт ключ - количество


def get_count_char(str_):  # заводим функцию для подсчета
    for i in range(len(str_)):  # проходимся циклом по строке
        if str_[i] .isalpha() is True:  # проверяем что элемент в строке - буква
            if slovar .get(str_[i].lower()) is None:  # если нет элемента в словаре по данному ключу
                slovar[str_[i].lower()] = 1  # записываем  что элемент встретился один раз. в квадратных скобках - ключ
            else:
                slovar[str_[i].lower()] = int(slovar[str_[i].lower()]) + 1  # если уже встречали ранее то прибавляем 1
    return slovar


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

print(get_count_char(main_str))
# пустая строка
